In [1]:
import pandas as pd 
dt=pd.read_excel('Groups.xlsx')
dt

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29
6       26       24       21

In [2]:
dt.head()

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26

In [3]:
dt.head(2)

   Group A  Group B  Group C
0       23       19       14
1       21       21       13

In [4]:
dt.tail(3)

   Group A  Group B  Group C
4       23       28       26
5       22       30       29
6       26       24       21

In [5]:
dt.shape

(7, 3)

In [6]:
dt.columns

Index(['Group A', 'Group B', 'Group C'], dtype='object')

In [7]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Group A  7 non-null      int64
 1   Group B  7 non-null      int64
 2   Group C  7 non-null      int64
dtypes: int64(3)
memory usage: 296.0 bytes

In [8]:
dt['Group A']

0    23
1    21
2    19
3    23
4    23
5    22
6    26
Name: Group A, dtype: int64

In [9]:
dt[['Group A']]

   Group A
0       23
1       21
2       19
3       23
4       23
5       22
6       26

In [10]:
dt.sample(2)

   Group A  Group B  Group C
3       23       29       23
5       22       30       29

In [11]:
dt.sample(3)

   Group A  Group B  Group C
2       19       25       31
4       23       28       26
3       23       29       23

In [13]:
dt[['Group A']].head(2)

   Group A
0       23
1       21

In [14]:
dt[['Group A']].tail(2)

   Group A
5       22
6       26

In [15]:
dt[2:7]

   Group A  Group B  Group C
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29
6       26       24       21

In [16]:
dt[2:5]

   Group A  Group B  Group C
2       19       25       31
3       23       29       23
4       23       28       26

In [17]:
dt[-2:]

   Group A  Group B  Group C
5       22       30       29
6       26       24       21

In [18]:
dt[-3:]

   Group A  Group B  Group C
4       23       28       26
5       22       30       29
6       26       24       21